{"products":[{"PutRequest":{"Item":{"name":{"S":"warwick"},"tags":{"SS":["Fighter","Tank"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Warwick_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Warwick_0.jpg"},"description":{"S":"Warwick is a monster who hunts the gray alleys of Zaun. Transformed by agonizing experiments, his body is fused with an intricate system of chambers and pumps, machinery filling his veins with alchemical rage. Bursting out of the shadows, he preys upon those criminals who terrorize the city's depths. Warwick is drawn to blood, and driven mad by its scent. None who spill it can escape him."},"difficult":{"N":"3"},"price":{"N":"450"}}}},{"PutRequest":{"Item":{"name":{"S":"xayah"},"tags":{"SS":["Marksman"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xayah_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Xayah_0.jpg"},"description":{"S":"Deadly and precise, Xayah is a vastayan revolutionary waging a personal war to save her people. She uses her speed, guile, and razor-sharp feather blades to cut down anyone who stands in her way. Xayah fights alongside her partner and lover, Rakan, to protect their dwindling tribe, and restore their race to her vision of its former glory."},"difficult":{"N":"5"},"price":{"N":"4800"}}}},{"PutRequest":{"Item":{"name":{"S":"xerath"},"tags":{"SS":["Mage"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Xerath_0.jpg"},"description":{"S":"Xerath is an Ascended Magus of ancient Shurima, a being of arcane energy writhing in the broken shards of a magical sarcophagus. For millennia, he was trapped beneath the desert sands, but the rise of Shurima freed him from his ancient prison. Driven insane with power, he now seeks to take what he believes is rightfully his and replace the upstart civilizations of the world with one fashioned in his image."},"difficult":{"N":"8"},"price":{"N":"1350"}}}},{"PutRequest":{"Item":{"name":{"S":"xinzhao"},"tags":{"SS":["Fighter","Assassin"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/XinZhao_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/XinZhao_0.jpg"},"description":{"S":"Xin Zhao is a resolute warrior loyal to the ruling Lightshield dynasty. Once condemned to the fighting pits of Noxus, he survived countless gladiatorial bouts, but after being freed by Demacian forces, he swore his life and allegiance to these brave liberators. Armed with his favored three-talon spear, Xin Zhao now fights for his adopted kingdom, audaciously challenging any foe, no matter the odds."},"difficult":{"N":"2"},"price":{"N":"1350"}}}},{"PutRequest":{"Item":{"name":{"S":"yasuo"},"tags":{"SS":["Fighter","Assassin"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Yasuo_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Yasuo_0.jpg"},"description":{"S":"An Ionian of deep resolve, Yasuo is an agile swordsman who wields the air itself against his enemies. As a proud young man, he was falsely accused of murdering his master—unable to prove his innocence, he was forced to slay his own brother in self defense. Even after his master's true killer was revealed, Yasuo still could not forgive himself for all he had done, and now wanders his homeland with only the wind to guide his blade."},"difficult":{"N":"10"},"price":{"N":"1350"}}}},{"PutRequest":{"Item":{"name":{"S":"yone"},"tags":{"SS":["Assassin","Fighter"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Yone_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Yone_0.jpg"},"description":{"S":"In life, he was Yone—half-brother of Yasuo, and renowned student of his village's sword school. But upon his death at the hands of his brother, he found himself hunted by a malevolent entity of the spirit realm, and was forced to slay it with its own sword. Now, cursed to wear its demonic mask upon his face, Yone tirelessly hunts all such creatures in order to understand what he has become."},"difficult":{"N":"8"},"price":{"N":"3150"}}}},{"PutRequest":{"Item":{"name":{"S":"yorick"},"tags":{"SS":["Fighter","Tank"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Yorick_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Yorick_0.jpg"},"description":{"S":"The last survivor of a long-forgotten religious order, Yorick is both blessed and cursed with power over the dead. Trapped on the Shadow Isles, his only companions are the rotting corpses and shrieking spirits that he gathers to him. Yorick's monstrous actions belie his noble purpose: to free his home from the curse of the Ruination."},"difficult":{"N":"6"},"price":{"N":"3150"}}}},{"PutRequest":{"Item":{"name":{"S":"yuumi"},"tags":{"SS":["Support","Mage"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Yuumi_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Yuumi_0.jpg"},"description":{"S":"A magical cat from Bandle City, Yuumi was once the familiar of a yordle enchantress, Norra. When her master mysteriously disappeared, Yuumi became the Keeper of Norra's sentient Book of Thresholds, traveling through portals in its pages to search for her. Yearning for affection, Yuumi seeks friendly companions to partner with on her journey, protecting them with luminous shields and fierce resolve. While Book strives to keep her on task, Yuumi is often drawn to worldly comforts, such as naps and fish. In the end, however, she always returns to her quest to find her friend."},"difficult":{"N":"2"},"price":{"N":"450"}}}},{"PutRequest":{"Item":{"name":{"S":"zac"},"tags":{"SS":["Tank","Fighter"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Zac_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Zac_0.jpg"},"description":{"S":"Zac is the product of a toxic spill that ran through a chemtech seam and pooled in an isolated cavern deep in Zaun's Sump. Despite such humble origins, Zac has grown from primordial ooze into a thinking being who dwells in the city's pipes, occasionally emerging to help those who cannot help themselves or to rebuild the broken infrastructure of Zaun."},"difficult":{"N":"8"},"price":{"N":"4800"}}}},{"PutRequest":{"Item":{"name":{"S":"zed"},"tags":{"SS":["Assassin"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Zed_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Zed_0.jpg"},"description":{"S":"Utterly ruthless and without mercy, Zed is the leader of the Order of Shadow, an organization he created with the intent of militarizing Ionia's magical and martial traditions to drive out Noxian invaders. During the war, desperation led him to unlock the secret shadow form—a malevolent spirit magic as dangerous and corrupting as it is powerful. Zed has mastered all of these forbidden techniques to destroy anything he sees as a threat to his nation, or his new order."},"difficult":{"N":"7"},"price":{"N":"1350"}}}},{"PutRequest":{"Item":{"name":{"S":"zeri"},"tags":{"SS":["Marksman"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Zeri_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Zeri_0.jpg"},"description":{"S":"A headstrong, spirited young woman from Zaun's working-class, Zeri channels her electric magic to charge herself and her custom-crafted gun. Her volatile power mirrors her emotions, its sparks reflecting her lightning-fast approach to life. Deeply compassionate toward others, Zeri carries the love of her family and her home into every fight. Though her eagerness to help can sometimes backfire, Zeri believes one truth to be certain: stand up for your community, and it will stand up with you."},"difficult":{"N":"6"},"price":{"N":"6300"}}}},{"PutRequest":{"Item":{"name":{"S":"ziggs"},"tags":{"SS":["Mage"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ziggs_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Ziggs_0.jpg"},"description":{"S":"With a love of big bombs and short fuses, the yordle Ziggs is an explosive force of nature. As an inventor's assistant in Piltover, he was bored by his predictable life and befriended a mad, blue-haired bomber named Jinx. After a wild night on the town, Ziggs took her advice and moved to Zaun, where he now explores his fascinations more freely, terrorizing the chem-barons and regular citizens alike in his never ending quest to blow stuff up."},"difficult":{"N":"4"},"price":{"N":"4800"}}}},{"PutRequest":{"Item":{"name":{"S":"zilean"},"tags":{"SS":["Support","Mage"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Zilean_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Zilean_0.jpg"},"description":{"S":"Once a powerful Icathian mage, Zilean became obsessed with the passage of time after witnessing his homeland's destruction by the Void. Unable to spare even a minute to grieve the catastrophic loss, he called upon ancient temporal magic to divine all possible outcomes. Having become functionally immortal, Zilean now drifts through the past, present, and future, bending and warping the flow of time around him, always searching for that elusive moment that will turn back the clock and undo Icathia's destruction."},"difficult":{"N":"6"},"price":{"N":"1350"}}}},{"PutRequest":{"Item":{"name":{"S":"zoe"},"tags":{"SS":["Mage","Support"]},"coverImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Zoe_0.jpg"},"thumbnailImage":{"S":"http://ddragon.leagueoflegends.com/cdn/img/champion/loading/Zoe_0.jpg"},"description":{"S":"As the embodiment of mischief, imagination, and change, Zoe acts as the cosmic messenger of Targon, heralding major events that reshape worlds. Her mere presence warps the arcane mathematics governing realities, sometimes causing cataclysms without conscious effort or malice. This perhaps explains the breezy nonchalance with which Zoe approaches her duties, giving her plenty of time to focus on playing games, tricking mortals, or otherwise amusing herself. An encounter with Zoe can be joyous and life affirming, but it is always more than it appears and often extremely dangerous."},"difficult":{"N":"5"},"price":{"N":"4800"}}}}]}